cases/evaporatingDrop/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    atmosphere
    {
        type            fixedValue;
        value           uniform 300;
    }
    
    sides
    {
        type            symmetryPlane;
    }
    
    heatedWall
    {
        type            fixedValue;
        value           uniform 450;
    }
    
    defaultFaces
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
