cases/evaporatingDrop/system/VOFSetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      VOFSetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultSpecies
(
    N2   1.0
);

vaporPhaseName   alphaVapor;

shapes
(
    WaterFilm
    {
        alphaName  alphaLiquid;
        
        shape      ellipsoid;
        
        ellipsoidCoeffs
        {
            center   (0.0025 0.005 0.0005);
            radius   (0.0015 0.0015 0);
        }
        
        delVapor 1e-2;
        U        (0.25 0 0);
        
        liquidSpecies
        (
            H2OL  1.0
        );
        vaporSpecies
        (
            H2O   0.1
        );
    }
);


// ************************************************************************* //
